## Reg No. 124

In [3]:
import numpy as np
import pandas as pd

In [4]:
#creating dataset for 10 students using dictionary.
student = {'Name':['Joy', 'Peter', 'Paul', 'Grace', 'Bola', 'Debby', 'Eno', 'Emem','Tolu', 'Will'],
          'Age': [22, 23, 26, 25, 27, 21, 24,19,26,27], 
          'Relationship status': ['Single', 'Single', 'Married','Single','Single','Single','Married','Single', 'Married', 'Married'],
          'Department':['BCH', 'Law', 'Chemistry','Biology', 'Mathematics', 'Physics','English', 'Medicine', 'Pharmacy','Insurance']}

In [5]:
#Add cgpa to the dictionary
student['CGPA'] = [3.0, 4.5, 3.4, 2.4, 4.0, 3.1, 1.8, 2.7,3.9, 3.7]

In [6]:
student

{'Name': ['Joy',
  'Peter',
  'Paul',
  'Grace',
  'Bola',
  'Debby',
  'Eno',
  'Emem',
  'Tolu',
  'Will'],
 'Age': [22, 23, 26, 25, 27, 21, 24, 19, 26, 27],
 'Relationship status': ['Single',
  'Single',
  'Married',
  'Single',
  'Single',
  'Single',
  'Married',
  'Single',
  'Married',
  'Married'],
 'Department': ['BCH',
  'Law',
  'Chemistry',
  'Biology',
  'Mathematics',
  'Physics',
  'English',
  'Medicine',
  'Pharmacy',
  'Insurance'],
 'CGPA': [3.0, 4.5, 3.4, 2.4, 4.0, 3.1, 1.8, 2.7, 3.9, 3.7]}

In [7]:
#Remove relationship status from the dictionary
student.pop('Relationship status')
student

{'Name': ['Joy',
  'Peter',
  'Paul',
  'Grace',
  'Bola',
  'Debby',
  'Eno',
  'Emem',
  'Tolu',
  'Will'],
 'Age': [22, 23, 26, 25, 27, 21, 24, 19, 26, 27],
 'Department': ['BCH',
  'Law',
  'Chemistry',
  'Biology',
  'Mathematics',
  'Physics',
  'English',
  'Medicine',
  'Pharmacy',
  'Insurance'],
 'CGPA': [3.0, 4.5, 3.4, 2.4, 4.0, 3.1, 1.8, 2.7, 3.9, 3.7]}

In [8]:
df = pd.DataFrame(student)

In [9]:
df

    Name  Age   Department  CGPA
0    Joy   22          BCH   3.0
1  Peter   23          Law   4.5
2   Paul   26    Chemistry   3.4
3  Grace   25      Biology   2.4
4   Bola   27  Mathematics   4.0
5  Debby   21      Physics   3.1
6    Eno   24      English   1.8
7   Emem   19     Medicine   2.7
8   Tolu   26     Pharmacy   3.9
9   Will   27    Insurance   3.7

In [10]:
#Add admission_date (year, month and day)and gender columns to the dataframe
df['Admission_date'] = ['2022-3-11', '2022-3-11', '2022-3-12', '2022-3-16', '2022-3-17', '2022-3-19', '2022-3-28',  '2022-3-24', '2022-3-21', '2022-4-4']
df['Gender'] = ['Female', 'Male','Male', 'Female','Male','Female', 'Female','Female','Male','Male']

In [11]:
df

    Name  Age   Department  CGPA Admission_date  Gender
0    Joy   22          BCH   3.0      2022-3-11  Female
1  Peter   23          Law   4.5      2022-3-11    Male
2   Paul   26    Chemistry   3.4      2022-3-12    Male
3  Grace   25      Biology   2.4      2022-3-16  Female
4   Bola   27  Mathematics   4.0      2022-3-17    Male
5  Debby   21      Physics   3.1      2022-3-19  Female
6    Eno   24      English   1.8      2022-3-28  Female
7   Emem   19     Medicine   2.7      2022-3-24  Female
8   Tolu   26     Pharmacy   3.9      2022-3-21    Male
9   Will   27    Insurance   3.7       2022-4-4    Male

In [12]:
#creating dataset for 10 students with list.
name =['Joy', 'Peter', 'Paul', 'Grace', 'Bola', 'Debby', 'Eno', 'Emem','Tolu', 'Will']
age = [22, 23, 26, 25, 27, 21, 24,19,26,27]
relationship = ['Single', 'Single', 'Married','Single','Single','Single','Married','Single', 'Married', 'Married']
department =['BCH', 'Law', 'Chemistry','Biology', 'Mathematics', 'Physics','English', 'Medicine', 'Pharmacy','Insurance']
gp = [3.0, 4.5, 3.4, 2.4, 4.0, 3.1, 1.8, 2.7,3.9, 3.7]
admission_date = ['2022-3-11', '2022-3-11', '2022-3-12', '2022-3-16', '2022-3-17', '2022-3-19', '2022-3-28',  '2022-3-24', '2022-3-21', '2022-4-4']
gender = ['Female', 'Male','Male', 'Female','Male','Female', 'Female','Female','Male','Male']

df2 = pd.DataFrame({'Name':name, 'Age':age, 'Relationship':relationship, 'Department':department, 'CGPA':gp, 'Admission_Date':admission_date, 'Gender':gender})

In [13]:
df2

    Name  Age Relationship   Department  CGPA Admission_Date  Gender
0    Joy   22       Single          BCH   3.0      2022-3-11  Female
1  Peter   23       Single          Law   4.5      2022-3-11    Male
2   Paul   26      Married    Chemistry   3.4      2022-3-12    Male
3  Grace   25       Single      Biology   2.4      2022-3-16  Female
4   Bola   27       Single  Mathematics   4.0      2022-3-17    Male
5  Debby   21       Single      Physics   3.1      2022-3-19  Female
6    Eno   24      Married      English   1.8      2022-3-28  Female
7   Emem   19       Single     Medicine   2.7      2022-3-24  Female
8   Tolu   26      Married     Pharmacy   3.9      2022-3-21    Male
9   Will   27      Married    Insurance   3.7       2022-4-4    Male

In [14]:
import datetime

In [15]:
df2

    Name  Age Relationship   Department  CGPA Admission_Date  Gender
0    Joy   22       Single          BCH   3.0      2022-3-11  Female
1  Peter   23       Single          Law   4.5      2022-3-11    Male
2   Paul   26      Married    Chemistry   3.4      2022-3-12    Male
3  Grace   25       Single      Biology   2.4      2022-3-16  Female
4   Bola   27       Single  Mathematics   4.0      2022-3-17    Male
5  Debby   21       Single      Physics   3.1      2022-3-19  Female
6    Eno   24      Married      English   1.8      2022-3-28  Female
7   Emem   19       Single     Medicine   2.7      2022-3-24  Female
8   Tolu   26      Married     Pharmacy   3.9      2022-3-21    Male
9   Will   27      Married    Insurance   3.7       2022-4-4    Male

In [16]:
# converting date to datetime object
df2['Admission_Date'] = pd.to_datetime(df2['Admission_Date'])
df2

    Name  Age Relationship   Department  CGPA Admission_Date  Gender
0    Joy   22       Single          BCH   3.0     2022-03-11  Female
1  Peter   23       Single          Law   4.5     2022-03-11    Male
2   Paul   26      Married    Chemistry   3.4     2022-03-12    Male
3  Grace   25       Single      Biology   2.4     2022-03-16  Female
4   Bola   27       Single  Mathematics   4.0     2022-03-17    Male
5  Debby   21       Single      Physics   3.1     2022-03-19  Female
6    Eno   24      Married      English   1.8     2022-03-28  Female
7   Emem   19       Single     Medicine   2.7     2022-03-24  Female
8   Tolu   26      Married     Pharmacy   3.9     2022-03-21    Male
9   Will   27      Married    Insurance   3.7     2022-04-04    Male

In [17]:
# Checking for data types of all columns
df2.dtypes

Name                      object
Age                        int64
Relationship              object
Department                object
CGPA                     float64
Admission_Date    datetime64[ns]
Gender                    object
dtype: object

In [18]:
df2['year'] = df2['Admission_Date'].dt.year
df2

    Name  Age Relationship   Department  CGPA Admission_Date  Gender  year
0    Joy   22       Single          BCH   3.0     2022-03-11  Female  2022
1  Peter   23       Single          Law   4.5     2022-03-11    Male  2022
2   Paul   26      Married    Chemistry   3.4     2022-03-12    Male  2022
3  Grace   25       Single      Biology   2.4     2022-03-16  Female  2022
4   Bola   27       Single  Mathematics   4.0     2022-03-17    Male  2022
5  Debby   21       Single      Physics   3.1     2022-03-19  Female  2022
6    Eno   24      Married      English   1.8     2022-03-28  Female  2022
7   Emem   19       Single     Medicine   2.7     2022-03-24  Female  2022
8   Tolu   26      Married     Pharmacy   3.9     2022-03-21    Male  2022
9   Will   27      Married    Insurance   3.7     2022-04-04    Male  2022

In [19]:
df2['month'] = df2['Admission_Date'].dt.month
df2

,Name,Age,Relationship,Department,CGPA,Admission_Date,Gender,year,month
0,Joy,22,Single,BCH,3.0,2022-03-11,Female,2022,3
1,Peter,23,Single,Law,4.5,2022-03-11,Male,2022,3
2,Paul,26,Married,Chemistry,3.4,2022-03-12,Male,2022,3
3,Grace,25,Single,Biology,2.4,2022-03-16,Female,2022,3
4,Bola,27,Single,Mathematics,4.0,2022-03-17,Male,2022,3
5,Debby,21,Single,Physics,3.1,2022-03-19,Female,2022,3
6,Eno,24,Married,English,1.8,2022-03-28,Female,2022,3
7,Emem,19,Single,Medicine,2.7,2022-03-24,Female,2022,3
8,Tolu,26,Married,Pharmacy,3.9,2022-03-21,Male,2022,3
9,Will,27,Married,Insurance,3.7,2022-04-04,Male,2022,4

In [20]:
df2['day'] = df2['Admission_Date'].dt.day
df2

,Name,Age,Relationship,Department,CGPA,Admission_Date,Gender,year,month,day
0,Joy,22,Single,BCH,3.0,2022-03-11,Female,2022,3,11
1,Peter,23,Single,Law,4.5,2022-03-11,Male,2022,3,11
2,Paul,26,Married,Chemistry,3.4,2022-03-12,Male,2022,3,12
3,Grace,25,Single,Biology,2.4,2022-03-16,Female,2022,3,16
4,Bola,27,Single,Mathematics,4.0,2022-03-17,Male,2022,3,17
5,Debby,21,Single,Physics,3.1,2022-03-19,Female,2022,3,19
6,Eno,24,Married,English,1.8,2022-03-28,Female,2022,3,28
7,Emem,19,Single,Medicine,2.7,2022-03-24,Female,2022,3,24
8,Tolu,26,Married,Pharmacy,3.9,2022-03-21,Male,2022,3,21
9,Will,27,Married,Insurance,3.7,2022-04-04,Male,2022,4,4

In [21]:
df2.dtypes

Name                      object
Age                        int64
Relationship              object
Department                object
CGPA                     float64
Admission_Date    datetime64[ns]
Gender                    object
year                       int64
month                      int64
day                        int64
dtype: object

In [22]:
# Checking for missing values
df2.isna().sum()

Name              0
Age               0
Relationship      0
Department        0
CGPA              0
Admission_Date    0
Gender            0
year              0
month             0
day               0
dtype: int64

In [23]:
# Checking for percentage of  missing values
df2.isna().sum()/df2.shape[0]*100

Name              0.0
Age               0.0
Relationship      0.0
Department        0.0
CGPA              0.0
Admission_Date    0.0
Gender            0.0
year              0.0
month             0.0
day               0.0
dtype: float64

## Checking unique values in each of the columns

In [24]:
df2.Name.unique()

array(['Joy', 'Peter', 'Paul', 'Grace', 'Bola', 'Debby', 'Eno', 'Emem',
       'Tolu', 'Will'], dtype=object)

In [25]:
df2.Age.unique()

array([22, 23, 26, 25, 27, 21, 24, 19], dtype=int64)

In [26]:
df2.Relationship.unique()

array(['Single', 'Married'], dtype=object)

In [27]:
df2.Gender.unique()

array(['Female', 'Male'], dtype=object)

In [28]:
df2.Admission_Date.unique()

array(['2022-03-11T00:00:00.000000000', '2022-03-12T00:00:00.000000000',
       '2022-03-16T00:00:00.000000000', '2022-03-17T00:00:00.000000000',
       '2022-03-19T00:00:00.000000000', '2022-03-28T00:00:00.000000000',
       '2022-03-24T00:00:00.000000000', '2022-03-21T00:00:00.000000000',
       '2022-04-04T00:00:00.000000000'], dtype='datetime64[ns]')

In [29]:
df2.Department.unique()

array(['BCH', 'Law', 'Chemistry', 'Biology', 'Mathematics', 'Physics',
       'English', 'Medicine', 'Pharmacy', 'Insurance'], dtype=object)

In [30]:
df2.CGPA.unique()

array([3. , 4.5, 3.4, 2.4, 4. , 3.1, 1.8, 2.7, 3.9, 3.7])

In [31]:
df2.Name.nunique()

10

In [32]:
df2.Department.nunique()

10

In [33]:
df2.CGPA.nunique()

10

In [34]:
df2.Admission_Date.nunique()

9

In [35]:
df2.Age.nunique()

8

In [36]:
df2.Relationship.nunique()

2

In [37]:
df2.Gender.nunique()

2

## Checking value counts for each of the columns

In [38]:
df2.Name.value_counts()

Joy      1
Peter    1
Paul     1
Grace    1
Bola     1
Debby    1
Eno      1
Emem     1
Tolu     1
Will     1
Name: Name, dtype: int64

In [39]:
df2.Age.value_counts()

26    2
27    2
22    1
23    1
25    1
21    1
24    1
19    1
Name: Age, dtype: int64

In [40]:
df2.Department.value_counts()

BCH            1
Law            1
Chemistry      1
Biology        1
Mathematics    1
Physics        1
English        1
Medicine       1
Pharmacy       1
Insurance      1
Name: Department, dtype: int64

In [41]:
df2.CGPA.value_counts()

3.0    1
4.5    1
3.4    1
2.4    1
4.0    1
3.1    1
1.8    1
2.7    1
3.9    1
3.7    1
Name: CGPA, dtype: int64

In [42]:
df2.Admission_Date.value_counts()

2022-03-11    2
2022-03-12    1
2022-03-16    1
2022-03-17    1
2022-03-19    1
2022-03-28    1
2022-03-24    1
2022-03-21    1
2022-04-04    1
Name: Admission_Date, dtype: int64

In [43]:
df2.Relationship.value_counts()

Single     6
Married    4
Name: Relationship, dtype: int64

In [44]:
df2.Gender.value_counts()

Female    5
Male      5
Name: Gender, dtype: int64

In [45]:
#df.info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            10 non-null     object
 1   Age             10 non-null     int64
 2   Relationship    10 non-null     object
 3   Department      10 non-null     object
 4   CGPA            10 non-null     float64
 5   Admission_Date  10 non-null     datetime64[ns]
 6   Gender          10 non-null     object
 7   year            10 non-null     int64
 8   month           10 non-null     int64
 9   day             10 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(4)
memory usage: 928.0+ bytes

In [46]:
# df.describe()
df2.describe()

             Age       CGPA    year      month        day
count  10.000000  10.000000    10.0  10.000000  10.000000
mean   24.000000   3.250000  2022.0   3.100000  16.300000
std     2.708013   0.815475     0.0   0.316228   7.087548
min    19.000000   1.800000  2022.0   3.000000   4.000000
25%    22.250000   2.775000  2022.0   3.000000  11.250000
50%    24.500000   3.250000  2022.0   3.000000  16.500000
75%    26.000000   3.850000  2022.0   3.000000  20.500000
max    27.000000   4.500000  2022.0   4.000000  28.000000

In [47]:
# number of rows and colomns
df2.shape

(10, 10)

In [48]:
# Subset the dataframe for male gender
df2.query("Gender == 'Male'")

,Name,Age,Relationship,Department,CGPA,Admission_Date,Gender,year,month,day
1,Peter,23,Single,Law,4.5,2022-03-11,Male,2022,3,11
2,Paul,26,Married,Chemistry,3.4,2022-03-12,Male,2022,3,12
4,Bola,27,Single,Mathematics,4.0,2022-03-17,Male,2022,3,17
8,Tolu,26,Married,Pharmacy,3.9,2022-03-21,Male,2022,3,21
9,Will,27,Married,Insurance,3.7,2022-04-04,Male,2022,4,4

## Finding the mean,max, min, sum of CGPA

In [49]:
df2['CGPA'].mean()

3.25

In [50]:
df2['CGPA'].max()

4.5

In [51]:
df2['CGPA'].min()

1.8

In [52]:
df2['CGPA'].sum()

32.5

In [1]:
df2.to_csv('dfs.csv', index=False)

NameError: name 'df2' is not defined

In [2]:
pwd

'C:\\Users\\JIMMY PC'